#include "RendererReplace.hpp"
// #include "WickedEngine.h"
#include "D3dx9math.h"
#include "meshoptimizer.h"
#include "numeric"
#include "utility/MemArena.hpp"
#include <array>
#include <cstring>
#include <set>

#include <DxErr.h>
#pragma comment(lib, "dxerr.lib")

// size literals
constexpr std::size_t operator""_KiB(unsigned long long int x) {
    return 1024ULL * x;
}

constexpr std::size_t operator""_MiB(unsigned long long int x) {
    return 1024_KiB * x;
}

constexpr std::size_t operator""_GiB(unsigned long long int x) {
    return 1024_MiB * x;
}

static RendererReplace* g_rreplace{nullptr};

static bool g_3d_draw_cmd{false};

class DrawCommandMaybe {
public:
    class DrawCommandMaybe* m_ptr_next_draw_cmd;           // 0x0000
    class MeshDrawDataMaybe* m_ptr_mesh_draw_data;         // 0x0004
    uint32_t unk;                                          // 0x0008
    class SomeOtherTextureData* m_ptr_other_texture_stuff; // 0x000C
    class ZAndScrBlend* m_ptr_z_and_blendstate;            // 0x0010
    class MvpMatrix* m_ptr_mvp_matrix;                     // 0x0014
    void* m_unk_ptr;                                       // 0x0018
    class TextureData* m_ptr_texture_data;                 // 0x001C
    uint32_t unk_uint32;                                   // 0x0020
    uint32_t unk_uint32_0;                                 // 0x0024
    char pad_0028[32];                                     // 0x0028
}; // Size: 0x0048

class MeshDrawDataMaybe {
public:
    class MeshDrawDataMaybe* m_next_mesh_draw_data; // 0x0000
    uint32_t start_vertex;                          // 0x0004
    uint32_t prim_count;                            // 0x0008
}; // Size: 0x000C

class MvpMatrix {
public:
    Matrix4x4 model; // 0x0000
    Matrix4x4 view;  // 0x0040
    Matrix4x4 proj;  // 0x0080
}; // Size: 0x00C0

class ZAndScrBlend {
public:
    bool unk_bool_0;   // 0x0000
    bool unk_bool_1;   // 0x0001
    bool unk_bool_2;   // 0x0002
    bool unk_bool_3;   // 0x0003
    char pad_0004[64]; // 0x0004
}; // Size: 0x0044

#if 0
class TextureData
{
public:
    char pad_0000[4]; //0x0000
}; //Size: 0x0004
#endif

class SomeOtherTextureData {
public:
    char pad_0000[4]; // 0x0000
}; // Size: 0x0004
static DWORD g_vertices{0};
struct D3DDevicePtr {
    IDirect3DDevice9* device;
};

struct TempDIPThings {
    INT base_vertex_index{0};
    UINT min_vertex_index{0};
    UINT num_vertices{30438};
    UINT start_index{3321};
    UINT prim_count{24};
};

static TempDIPThings g_temp_dip_things{};
std::unordered_map<int, int> g_index_lookup_table;

static void d3d_draw_prim_wrapper(std::vector<std::pair<DWORD, DWORD>>& batches) {
    static D3DDevicePtr* device_ptr  = (D3DDevicePtr*)0x0252F374;
    static IDirect3DDevice9* pdevice = device_ptr->device;
    d3d_vbuffer* static_vbuffer      = (d3d_vbuffer*)0x0252FFA8;

    // std::reverse(batches.begin(), batches.end());
    DWORD primitve_count = std::accumulate(batches.begin(), batches.end(), 0, [](DWORD acc, const std::pair<DWORD, DWORD>& pair) {
        return acc + pair.second;
    });
    UINT numvertices     = batches.back().first - batches.front().first;
    if (static_vbuffer->pindexbuffer) {
        pdevice->SetIndices(static_vbuffer->pindexbuffer);
    }
    UINT index_count = 0;
    for (const auto& batch : batches) {
        // HRESULT result = pdevice->DrawPrimitive(D3DPT_TRIANGLESTRIP, batch.first, batch.second);
        HRESULT result = pdevice->DrawIndexedPrimitive(D3DPT_TRIANGLESTRIP, batch.first, 0, batch.second, 0, batch.second);
        assert(result == S_OK);
        // printf("hehe\n");
    }
    // HRESULT result = pdevice->DrawPrimitive(D3DPT_TRIANGLESTRIP, batches.front().first, primitve_count);
}
void d3d_emplace_back_triangles(std::vector<std::pair<DWORD, DWORD>>& batches, UINT vertexCount, UINT primitve_count, char a3) {
    typedef int (*d3d_switch_on_buffer_types_copy_data_and_lock_dmc3se_sub_6E18F0_t)(int a1);
    d3d_switch_on_buffer_types_copy_data_and_lock_dmc3se_sub_6E18F0_t d3d_switch_on_buffer_types_copy_data_and_lock_dmc3se_sub_6E18F0 = (d3d_switch_on_buffer_types_copy_data_and_lock_dmc3se_sub_6E18F0_t)0x006E1C00;
    DWORD benis                                                                                                                       = *(DWORD*)0x0252FFF0;

    if ((vertexCount & 3) == benis ||
        d3d_switch_on_buffer_types_copy_data_and_lock_dmc3se_sub_6E18F0(vertexCount & 3) >= 0) {
        DWORD start_vertex = vertexCount >> 2;
        if (a3) {
            auto v5 = 2;
            if (start_vertex < v5) {
                return;
            }
            start_vertex -= v5;
            primitve_count += v5;
        }
        batches.emplace_back(start_vertex, primitve_count - 2);
        // pdevice->DrawPrimitive(D3DPT_TRIANGLESTRIP, start_vertex, primitve_count - 2);
    }
#if 0
    typedef int (*d3d_switch_on_buffer_types_copy_data_and_lock_dmc3se_sub_6E18F0_t)(int a1);
    d3d_switch_on_buffer_types_copy_data_and_lock_dmc3se_sub_6E18F0_t  d3d_switch_on_buffer_types_copy_data_and_lock_dmc3se_sub_6E18F0 = (d3d_switch_on_buffer_types_copy_data_and_lock_dmc3se_sub_6E18F0_t)0x006E1C00;
    DWORD benis = *(DWORD*)0x0252FFF0;
    static D3DDevicePtr* device_ptr = (D3DDevicePtr*)0x0252F374;
    static IDirect3DDevice9* pdevice = device_ptr->device;
    d3d_vbuffer* static_vbuffer = (d3d_vbuffer*)0x0252FFA8;

    std::vector<std::pair<DWORD,DWORD>> batcherinos;
    for (auto& batch: batches) {
        if(d3d_switch_on_buffer_types_copy_data_and_lock_dmc3se_sub_6E18F0(batch.first & 3) >= 0) {
            if (a3) {
                batch.first -= 2;
                batch.second += 2;
            }
            batch.first = batch.first >> 2;
            batcherinos.push_back(batch);
        }
        
    }
    if(batcherinos.empty()) { return;}
        DWORD primitve_count = std::accumulate(batcherinos.begin(), batcherinos.end(),  0, [](DWORD acc, const std::pair<DWORD, DWORD>& pair) {
        return acc + pair.second;
    });
        DWORD a1 = batcherinos.begin()->first;
        DWORD a2 = batcherinos.back().first;
        size_t index_count = a1 - a2;
        size_t unindexed_vertex_count = index_count;
        std::reverse(batcherinos.begin(), batcherinos.end());
#if 0
        std::vector<unsigned int> remap(index_count);
        std::vector<unsigned int> indices(index_count);
        std::iota(indices.begin(), indices.end(), batches.back().first);
        std::reverse(indices.begin(), indices.end());

        size_t vertex_count = meshopt_generateVertexRemap(&remap[0],NULL, index_count, &indices[0], unindexed_vertex_count, sizeof(DWORD));
        meshopt_remapIndexBuffer(&indices[0], NULL, index_count, &remap[0]);
        pdevice->CreateIndexBuffer(index_count * sizeof(DWORD), 0, D3DFMT_INDEX32, D3DPOOL_DEFAULT, &indexBuffer, NULL);
        DWORD* d3dindices{};
        indexBuffer->Lock(0, 0, (void**)&d3dindices, 0);

        memcpy(d3dindices, indices.data(), sizeof(DWORD) * index_count);

        indexBuffer->Unlock();
#endif
        if(static_vbuffer->pindexbuffer) {
            pdevice->SetIndices(static_vbuffer->pindexbuffer);
        }

        printf("\tpdevice->DrawIndexedPrimitive(D3DPT_TRIANGLELIST, %d, %d);\n", batcherinos[0].first, primitve_count);
        //pdevice->DrawPrimitive(D3DPT_TRIANGLELIST, batches[0].first, primitve_count);
        auto result = pdevice->DrawIndexedPrimitive(D3DPT_TRIANGLELIST, batcherinos.front().first, 0, index_count, 1, primitve_count);
        assert(result == S_OK);
        //indexBuffer->Release();
#endif
}

void d3d_draw_primitive_maybe_sub_6E1C00(DWORD vertexCount, DWORD primitve_count, char a3) {
    typedef int (*d3d_switch_on_buffer_types_copy_data_and_lock_dmc3se_sub_6E18F0_t)(int a1);
    d3d_switch_on_buffer_types_copy_data_and_lock_dmc3se_sub_6E18F0_t d3d_switch_on_buffer_types_copy_data_and_lock_dmc3se_sub_6E18F0 = (d3d_switch_on_buffer_types_copy_data_and_lock_dmc3se_sub_6E18F0_t)0x006E1C00;
    DWORD benis                                                                                                                       = *(DWORD*)0x0252FFF0;
    static D3DDevicePtr* device_ptr                                                                                                   = (D3DDevicePtr*)0x0252F374;
    static IDirect3DDevice9* pdevice                                                                                                  = device_ptr->device;

    if ((vertexCount & 3) == benis ||
        d3d_switch_on_buffer_types_copy_data_and_lock_dmc3se_sub_6E18F0(vertexCount & 3) >= 0) {
        DWORD start_vertex = vertexCount >> 2;
        if (a3) {
            auto v5 = 2;
            if (start_vertex < v5) {
                return;
            }
            start_vertex -= v5;
            primitve_count += v5;
        }
        printf("\tpdevice->DrawPrimitive(D3DPT_TRIANGLESTRIP, %d, %d);\n", start_vertex, primitve_count - 2);
        pdevice->DrawPrimitive(D3DPT_TRIANGLESTRIP, start_vertex, primitve_count - 2);
    }
}

static HRESULT __stdcall d3d_dispatch_drawcalls(MeshDrawDataMaybe* mdd, char a3) {

    DWORD start_vertex{mdd->start_vertex};
    DWORD prim_count{mdd->prim_count};
    MeshDrawDataMaybe* m_next_draw_data               = mdd->m_next_mesh_draw_data;
    static constexpr void* d3d_draw_prim_func_address = &d3d_draw_primitive_maybe_sub_6E1C00;

    std::vector<std::pair<DWORD, DWORD>> batches;
#if 1
    do {
        if ((start_vertex & 3) != 1) {
            d3d_draw_primitive_maybe_sub_6E1C00(start_vertex, prim_count, a3);
            batches.clear();
        } else {
            d3d_emplace_back_triangles(batches, start_vertex, prim_count, a3);
        }
        if (m_next_draw_data) {
            start_vertex     = m_next_draw_data->start_vertex;
            prim_count       = m_next_draw_data->prim_count;
            m_next_draw_data = m_next_draw_data->m_next_mesh_draw_data;
        }
    } while (m_next_draw_data != NULL);
    if (batches.size() > 0) {
        d3d_draw_prim_wrapper(batches);
    }
#else
    do {
        d3d_draw_primitive_maybe_sub_6E1C00(start_vertex, prim_count, a3);
        if (m_next_draw_data) {
            start_vertex     = m_next_draw_data->start_vertex;
            prim_count       = m_next_draw_data->prim_count;
            m_next_draw_data = m_next_draw_data->m_next_mesh_draw_data;
        }
    } while (m_next_draw_data != NULL);
#endif
#if 0
    while (m_next_draw_data != NULL) {
        start_vertex = m_next_draw_data->start_vertex;
        prim_count = m_next_draw_data->prim_count;
        m_next_draw_data = m_next_draw_data->m_next_mesh_draw_data;
    }
#endif
    return D3D_OK;
#if 0
    DWORD start_vertex { mdd->start_vertex };
    DWORD prim_count { mdd->prim_count };
    MeshDrawDataMaybe* m_next_draw_data = mdd->m_next_mesh_draw_data;
    static constexpr uintptr_t d3d_draw_prim_func_address = 0x06E1C00;
    size_t counter = 0;
    HRESULT retval = D3D_OK;
    //static constexpr size_t batchsize = 0x38;
    DWORD* benis = (DWORD*)0x0252FFF0;
    DWORD type = start_vertex & 3;
    if (type == 1 && *benis == 1) {
        __debugbreak;
    }
    do {
        //if (counter % batchsize == 0) {
        printf("ass; benis=%d, type=%d, start_vertex=%d\n", *benis, type, start_vertex >> 2);
        typedef int (*d3d_switch_on_buffer_types_copy_data_and_lock_dmc3se_sub_6E18F0_t)(int a1);
        d3d_switch_on_buffer_types_copy_data_and_lock_dmc3se_sub_6E18F0_t  d3d_switch_on_buffer_types_copy_data_and_lock_dmc3se_sub_6E18F0 = (d3d_switch_on_buffer_types_copy_data_and_lock_dmc3se_sub_6E18F0_t)0x006E1C00;
        if (type == *benis || d3d_switch_on_buffer_types_copy_data_and_lock_dmc3se_sub_6E18F0(type) >= 0) {
            DWORD vertex_count = *(DWORD*)0x0252FFA4;
            retval = pdevice->DrawPrimitive(D3DPT_TRIANGLELIST, start_vertex>>2, prim_count-1);
        }
        //return retval;
#if 0
        __asm {
            mov edx, dword ptr[a3]
            mov eax, dword ptr[prim_count]
            mov ecx, dword ptr[start_vertex]
            push edx
            push eax
            push ecx
            mov eax, dword ptr[d3d_draw_prim_func_address]
            call eax
            add esp, 0Ch
        }
#endif
        //}
        if (m_next_draw_data) {
            m_next_draw_data = m_next_draw_data->m_next_mesh_draw_data;
            if (m_next_draw_data) {
                //if(counter % batchsize == 0) {
                //start_vertex = m_next_draw_data->start_vertex;
                prim_count += m_next_draw_data->prim_count;
                    //prim_count = 0;
                //}
                //prim_count += m_next_draw_data->prim_count;
            }
        }
        prev_type = type;
    }
    while(m_next_draw_data);
    if (type == 1) {
        device_ptr->device->SetIndices(indexBuffer);
        return pdevice->DrawIndexedPrimitive(D3DPT_TRIANGLESTRIP, 0, 0, g_vertices, 0, prim_count/3);
    }
    return D3D_OK;
    //DWORD* benis = (DWORD*)0x0252FFF0;
    //DWORD type = start_vertex & 3;

    //return device_ptr->device->DrawIndexedPrimitive(D3DPT_TRIANGLELIST, 0, 0, g_vertices, 0, prim_count);
#if 0

#endif

    DWORD iterator = 0;
    while (m_next_draw_data)
    {
        iterator++;
        prim_count += m_next_draw_data->prim_count;
    }
    printf("drawcal iterator: %d \n", iterator);
    return D3D_OK;
#endif
}

static uintptr_t d3d_dispatch_drawcall_jmp_back = 0x006DF677;
// clang-format off
static __declspec(naked) void d3d_dispatch_drawcall() {
    __asm {
        pushad
        mov dl, [edi+20h]
        push edx
        push esi
        call d3d_dispatch_drawcalls
        popad
        jmp dword ptr[d3d_dispatch_drawcall_jmp_back]
    }
}
// clang-format on

class VertexDef {
public:
    Vector3 pos;    // 0x0000
    Vector3 norm;   // 0x000C
    uint8_t diff_r; // 0x0018
    uint8_t diff_g; // 0x0019
    uint8_t diff_b; // 0x001A
    uint8_t diff_a; // 0x001B
    uint8_t spec_r; // 0x001C
    uint8_t spec_g; // 0x001D
    uint8_t spec_b; // 0x001E
    uint8_t spec_a; // 0x001F
    Vector2 uv0;    // 0x0020
    Vector2 uv1;    // 0x0028
    Vector2 uv2;    // 0x0030
}; // Size: 0x0038

#pragma region cdraw_reclass
// Created with ReClass.NET 1.2 by KN4CK3R

class cDrawSub {
public:
    class ModTansformsMatrices* obj_transforms_matrices_ptr;        // 0x0000
    uint8_t* skel_hierarchy;                                        // 0x0004
    uint8_t* skel_indicies_ptr;                                     // 0x0008
    uint8_t* skel_object_roots;                                     // 0x000C
    class ModTransformVec* skel_bones_ptr;                          // 0x0010
    class IDraw* IDrawVtable;                                       // 0x0014
    class IDrawOperate* IDrawOperateVtable;                         // 0x0018
    char pad_001C[132];                                             // 0x001C
    uint32_t draw_flag_or_something;                                // 0x00A0
    uint32_t ass;                                                   // 0x00A4
    uint16_t object_count;                                          // 0x00A8
    uint16_t bone_count;                                            // 0x00AA
    uint16_t tex_count;                                             // 0x00AC
    uint16_t idk3;                                                  // 0x00AE
    uint32_t unk1;                                                  // 0x00B0
    uint32_t unk2;                                                  // 0x00B4
    uint16_t unk3;                                                  // 0x00B8
    uint16_t unk4;                                                  // 0x00BA
    class SomeModelData* modnrender_data_ptr;                       // 0x00BC
    class rModel* model_ptr;                                        // 0x00C0
    class rTim2* texture_ptr;                                       // 0x00C4
    class TextureStuff0 (*texture_stuff0_ptr)[5];                   // 0x00C8
    class TextureStuff1* texture_stuff1_ptr;                        // 0x00CC
    class cDrawSubUnk2* cdrawsub2_unk0_ptr;                         // 0x00D0
    class cDrawSubUnk2* cdrawsub2_unk1_ptr;                         // 0x00D4
    class cDrawSubUnk2* cdrawsub2_unk2_ptr;                         // 0x00D8
    class cDrawSubUnk2* cdrawsub2_unk3_ptr;                         // 0x00DC
    class cDrawSubUnk2* cdrawsub2_unk4_ptr;                         // 0x00E0
    class cDrawSubUnk2* cdrawsub2_unk5_ptr;                         // 0x00E4
    class SomeTextureUintsIdk (*some_texture_uints_ptr)[2];         // 0x00E8
    class cDrawSubUnk6* cdrawsub_unk6_ptr;                          // 0x00EC
    class SomeTextureAlphaThing (*some_texture_alpha_thing_ptr)[1]; // 0x00F0
    class SomeTextureAlphaThing* some_texture_alpha_thing_ptr1;     // 0x00F4
    Matrix4x4* bone_matrices_ptr;                                   // 0x00F8
    class cDrawSubUnk7* cdrawsub_unk7_ptr;                          // 0x00FC
    Matrix4x4* some_matrix_ptr;                                     // 0x0100
    class UnkVecMaybe* some_ptr_vec_maybe;                          // 0x0104
    char pad_0108[8];                                               // 0x0108
    Matrix4x4 some_matrix0;                                         // 0x0110
    Matrix4x4 some_matrix1;                                         // 0x0150
}; // Size: 0x0190

class cDrawSCM {
public:
    char pad_0000[44];        // 0x0000
    class cDrawSub N0000005A; // 0x002C
    char pad_01BC[4116];      // 0x01BC
}; // Size: 0x11D0

class rTim2 {
public:
    char pad_0000[2048]; // 0x0000
    char tim2header[4];  // 0x0800
    char pad_0804[2048]; // 0x0804
}; // Size: 0x1004

class rModelObjectHeaders {
public:
    uint8_t meshCount;              // 0x0000
    uint8_t unk;                    // 0x0001
    uint16_t vertCount;             // 0x0002
    class rModelMesh* objectOffset; // 0x0004
    uint32_t objFlags;              // 0x0008
    uint8_t reserved[20];           // 0x000C
    Vector3 spherePos;              // 0x0020
    float radius;                   // 0x002C
}; // Size: 0x0030

class rModel {
public:
    char modfourcc[4];                   // 0x0000
    float version;                       // 0x0004
    uint64_t reserved;                   // 0x0008
    uint8_t objectCount;                 // 0x0010
    uint8_t boneCount;                   // 0x0011
    uint8_t texCount;                    // 0x0012
    uint8_t unk[9];                      // 0x0013
    uint32_t skelOffset;                 // 0x001C
    char pad_0020[16];                   // 0x0020
    class rModelObjectHeaders N00000E39; // 0x0030
    char pad_0060[220];                  // 0x0060
}; // Size: 0x013C

class cDraw {
public:
    char pad_0000[8];                 // 0x0000
    uint32_t some_field;              // 0x0008
    uint32_t pad;                     // 0x000C
    uint32_t draw_flag;               // 0x0010
    class rTim2* tim2;                // 0x0014
    uint32_t pad1;                    // 0x0018
    void* some_allocator_type_thing1; // 0x001C
    void* some_allocator_type_thing;  // 0x0020
    uint32_t notSure;                 // 0x0024
    uint32_t notSure1;                // 0x0028
    class cDrawSub cDrawSub;          // 0x002C
}; // Size: 0x01BC

class ModTransformVec {
public:
    Vector4 pos; // 0x0000
    Vector4 rot; // 0x0010
}; // Size: 0x0020

class ModTansformsMatrices {
public:
    Matrix4x4 unk;                    // 0x0000
    Matrix4x4 world_maybe;            // 0x0040
    class ModTansformsMatrices* next; // 0x0080
    uint32_t idk;                     // 0x0084
}; // Size: 0x0088

class TextureStuff1 {
public:
    char pad_0000[4100]; // 0x0000
}; // Size: 0x1004

class TextureStuff0 {
public:
    void* some_texture_offset; // 0x0000
    uint32_t field_04;         // 0x0004
    uint32_t field_08;         // 0x0008
    uint32_t field_0C;         // 0x000C
    uint32_t field_10;         // 0x0010
    uint32_t field_14;         // 0x0014
    uint32_t field_18;         // 0x0018
    uint32_t field_1C;         // 0x001C
    uint32_t field_20;         // 0x0020
    uint32_t field_24;         // 0x0024
    uint32_t field_28;         // 0x0028
    uint32_t field_2c;         // 0x002C
}; // Size: 0x0030

class UnkVecMaybe {
public:
    Vector4 maybe_vec; // 0x0000
}; // Size: 0x0010

class SomeTextureUintsIdk {
public:
    uint32_t field0;  // 0x0000
    uint32_t field4;  // 0x0004
    uint32_t field8;  // 0x0008
    uint32_t fieldC;  // 0x000C
    char pad_0010[8]; // 0x0010
    uint32_t field18; // 0x0018
    uint32_t field1C; // 0x001C
    char pad_0020[8]; // 0x0020
    uint32_t field28; // 0x0028
    char pad_002C[4]; // 0x002C
}; // Size: 0x0030

class SomeTextureAlphaThing {
public:
    float flt0;  // 0x0000
    float flt4;  // 0x0004
    float flt8;  // 0x0008
    float fltC;  // 0x000C
    float flt10; // 0x0010
    float flt14; // 0x0014
    float flt18; // 0x0018
    float flt1C; // 0x001C
}; // Size: 0x0020

class rModelHeader {
public:
    char fourcc[4];                  // 0x0000
    float version;                   // 0x0004
    uint64_t reserved;               // 0x0008
    uint8_t objectCount;             // 0x0010
    uint8_t boneCount;               // 0x0011
    uint8_t texCount;                // 0x0012
    uint8_t unk[9];                  // 0x0013
    void* skelOffs;                  // 0x001C
    void* someOffset;                // 0x0020
    void* someOtherOffset;           // 0x0024
    void* someOtherOtherOffset;      // 0x0028
    void* someOtherOtherOtherOffset; // 0x002C
}; // Size: 0x0030

class rModelSCM : public rModelHeader {
public:
    class rModelObjectHeaders objects[114]; // 0x0030 size = header.objectCount
    char pad_1590[5524];                    // 0x1590
}; // Size: 0x2B24

class rModelMeshHdr {
public:
    uint16_t vertCount;                 // 0x0000
    uint16_t texInd;                    // 0x0002
    uint64_t reserved;                  // 0x0004
    Vector3* vertsOffset;               // 0x000C
    Vector3* normalsOffs;               // 0x0010
    class rModelUVData* uvsOffset;      // 0x0014
    void* someOffset;                   // 0x0018
    void* someOtherOffset;              // 0x001C
    class rModelSCMData* scmDataOffset; // 0x0020
    uint32_t idk00;                     // 0x0024
    uint32_t idk01;                     // 0x0028
    uint32_t idk02;                     // 0x002C
}; // Size: 0x0030

class rModelMesh : public rModelMeshHdr {
public:
}; // Size: 0x0030

class Object : public rModelMesh {
public:
}; // Size: 0x0030

class rModelUVData {
public:
    int16_t u; // 0x0000
    int16_t t; // 0x0002
}; // Size: 0x0004

class rModelVertColor {
public:
    uint8_t red;   // 0x0000
    uint8_t green; // 0x0001
    uint8_t blue;  // 0x0002
}; // Size: 0x0003

class rModelSCMData : public rModelVertColor {
public:
    uint8_t triSkipFlag; // 0x0003
}; // Size: 0x0004

class rModelBone {
public:
    Vector3 pos;    // 0x0000
    float length;   // 0x000C
    Vector3 unkVec; // 0x0010
    float unk;      // 0x001C
}; // Size: 0x0020

class rModelSkeleton {
public:
    void* hierarchyOffset;           // 0x0000
    void* indexOffset;               // 0x0004
    void* objectRootsOffset;         // 0x0008
    void* boneTransformOffset;       // 0x000C
    uint32_t notBoneCount;           // 0x0010
    uint8_t unk[12];                 // 0x0014
    uint8_t hierarchy[116];          // 0x0020 length == notBoneCount?
    uint8_t indicies[116];           // 0x0094
    uint8_t objectRoots[116];        // 0x0108
    uint32_t reserved;               // 0x017C
    class rModelBone N000010A8[115]; // 0x0180
}; // Size: 0x0FE0

class SomeRenderDataIdkAnonStruct {
public:
    uint32_t some_int;                     // 0x0000
    uint32_t N00001DEE;                    // 0x0004
    uint32_t eeee_int;                     // 0x0008
    char pad_000C[4];                      // 0x000C
    uint32_t some_table_lookup_int0;       // 0x0010
    uint32_t some_table_lookup_int1;       // 0x0014
    uint32_t n_int;                        // 0x0018
    char pad_001C[4];                      // 0x001C
    uint32_t table_lookup_int2;            // 0x0020
    uint32_t table_lookup_int3;            // 0x0024
    uint32_t g_int;                        // 0x0028
    uint32_t N00001DF8;                    // 0x002C
    uint32_t some_int1;                    // 0x0030
    uint32_t N00001392_;                   // 0x0034
    uint32_t b_int;                        // 0x0038
    uint32_t N00001DFC;                    // 0x003C
    uint32_t some_obj_flags_bitwise_thing; // 0x0040
    uint32_t some_int_unk;                 // 0x0044
    char pad_0048[4];                      // 0x0048
    uint32_t N00001E07;                    // 0x004C
}; // Size: 0x0050

class SmdScratchBufferMaybe {
public:
    char pad_0000[144]; // 0x0000
}; // Size: 0x0090

class SomeModelData {
public:
    uint32_t fld0;                                         // 0x0000
    uint8_t flag0;                                         // 0x0004
    uint8_t flag1;                                         // 0x0005
    uint8_t flag2;                                         // 0x0006
    uint8_t flag3;                                         // 0x0007
    uint32_t vert_accumulator;                             // 0x0008
    uint8_t mesh_count;                                    // 0x000C
    uint8_t N000019A8;                                     // 0x000D
    uint8_t some_skel_stuff;                               // 0x000E
    uint8_t N000019A9;                                     // 0x000F
    uint32_t N00001380;                                    // 0x0010
    uint32_t some_rendering_flags_again;                   // 0x0014
    class rModelObjectHeaders* r_model_obj_headers_ptr;    // 0x0018
    class SomeRenderingData* ptr_has_some_rendering_data;  // 0x001C
    Vector4 sphere;                                        // 0x0020
    class cDrawSubUnk2* cdrawsubs_array[6];                // 0x0030
    uint32_t N0000138B;                                    // 0x0048
    uint32_t N0000138C;                                    // 0x004C
    uint32_t some_table_lookup_int0;                       // 0x0050
    uint32_t some_table_lookup_int1;                       // 0x0054
    uint32_t some_table_lookup_int2;                       // 0x0058
    uint32_t some_table_lookup_int3;                       // 0x005C
    uint32_t some_int1;                                    // 0x0060
    uint32_t N00001392;                                    // 0x0064
    uint32_t some_obj_flags_bitwise_thing;                 // 0x0068
    uint32_t some_int_unk;                                 // 0x006C
    uint32_t some_result_int;                              // 0x0070
    char pad_0074[12];                                     // 0x0074
    class SomeRenderDataIdkAnonStruct some_anon_struct0;   // 0x0080
    class SomeRenderDataIdkAnonStruct some_anon_struct1;   // 0x00D0
    uint32_t N000013C1;                                    // 0x0120
    uint32_t N000013C2;                                    // 0x0124
    uint32_t N000013C3;                                    // 0x0128
    uint32_t N000013C4;                                    // 0x012C
    Vector4 emissive;                                      // 0x0130
    uint32_t N000013C9;                                    // 0x0140
    uint32_t N000013CA;                                    // 0x0144
    uint32_t N000013CB;                                    // 0x0148
    uint32_t some_flag0;                                   // 0x014C
    char pad_0150[16];                                     // 0x0150
    Vector4 emissive_copy;                                 // 0x0160
    char pad_0170[12];                                     // 0x0170
    uint32_t some_flag1;                                   // 0x017C
    char pad_0180[304];                                    // 0x0180
    class SmdScratchBufferMaybe some_scratch_buffer_maybe; // 0x02B0
}; // Size: 0x0340

class cDrawSubUnk2 {
public:
    uint32_t f0;                                           // 0x0000
    class cDrawSubUnk2* cdsu_next_ptr;                     // 0x0004
    uint32_t f8;                                           // 0x0008
    uint32_t fc;                                           // 0x000C
    uint32_t f10;                                          // 0x0010
    class SomeTextureAlphaThing* some_tex_alpha_thing_ptr; // 0x0014
    uint32_t some_static_memory_stuff;                     // 0x0018
    uint32_t f1c;                                          // 0x001C
    uint32_t field_20;                                     // 0x0020
    Matrix4x4* projection_maybe;                           // 0x0024
    uint32_t field_28;                                     // 0x0028
    uint32_t field_2C;                                     // 0x002C
}; // Size: 0x0030

class SomeRenderingData {
public:
    uint32_t batches_maybe;                      // 0x0000
    uint32_t vert_count;                         // 0x0004
    uint32_t tex_ind;                            // 0x0008
    class rModelMeshHdr* model_mesh_hdr_ptr;     // 0x000C
    uint32_t offset_0x10;                        // 0x0010
    uint32_t offset_0x14;                        // 0x0014
    uint32_t offset_0x18;                        // 0x0018
    uint32_t offset_0x1C;                        // 0x001C
    uint32_t offset_0x20;                        // 0x0020
    uint32_t offset_0x24;                        // 0x0024
    uint32_t offset_0x28;                        // 0x0028
    uint32_t offset_0x2C;                        // 0x002C
    uint8_t offset_0x30;                         // 0x0030
    char pad_0031[3];                            // 0x0031
    uint32_t bone_count;                         // 0x0034
    Matrix4x4* world;                            // 0x0038
    char pad_003C[4];                            // 0x003C
    class SomeRenderDataIdkAnonStruct N00001A0B; // 0x0040
    class SomeRenderDataIdkAnonStruct N00001A0C; // 0x0090
    uint32_t offset_0xE0;                        // 0x00E0
    uint32_t offset_0xE4;                        // 0x00E4
    uint32_t offset_0xE8;                        // 0x00E8
    uint32_t offset_0xEC;                        // 0x00EC
    void* anon_struct0;                          // 0x00F0
    void* anon_struct1;                          // 0x00F4
    Vector3* verts_ptr0;                         // 0x00F8
    Vector3* verts_ptr1;                         // 0x00FC
    Vector3* normals_ptr;                        // 0x0100
    Vector3* normals_ptr1;                       // 0x0104
    class rModelUVData* uvdata_ptr;              // 0x0108
    class rModelUVData* uvdata_ptr1;             // 0x010C
    class rModelBoneIndices* boindata_ptr0;      // 0x0110
    class rModelBoneIndices* boindata_ptr1;      // 0x0114
    class rModelWeightsData* weightdata_ptr0;    // 0x0118
    class rModelWeightsData* weightdata_ptr1;    // 0x011C
    class rModelSCMData* scmdata_ptr;            // 0x0120
    class rModelSCMData* scmdata_ptr1;           // 0x0124
    class RenderUVFudge* render_uv_fudge0;       // 0x0128
    class RenderUVFudge* render_uv_fudge1;       // 0x012C
    Vector3* verts_ptr2;                         // 0x0130
}; // Size: 0x0134

class RenderUVFudge {
public:
    int32_t some_uvx_fudge; // 0x0000
    int32_t some_uvy_fude;  // 0x0004
    uint32_t N00001CC7;     // 0x0008
    uint32_t N00001CC8;     // 0x000C
    uint32_t N00001CC9;     // 0x0010
    char pad_0014[4];       // 0x0014
}; // Size: 0x0018

class cDrawSubUnk6 {
public:
    char pad_0000[260]; // 0x0000
}; // Size: 0x0104

class cDrawSubUnk7 {
public:
    char pad_0000[4]; // 0x0000
}; // Size: 0x0004

class IDraw {
public:
    void* N00001BDA[57]; // 0x0000
}; // Size: 0x00E4

class IDrawOperate {
public:
    void* N00001F51[45]; // 0x0000
}; // Size: 0x00B4

class N00002118 {
public:
    Matrix4x4 N00002119; // 0x0000
    char pad_0040[288];  // 0x0040
}; // Size: 0x0160

class rModelWeightsData {
public:
    uint16_t bone_weights; // 0x0000
}; // Size: 0x0004

class SomeStackThing {
public:
    class SomeRenderingData* p_some_rendering_data; // 0x0000
    Matrix4x4* p_matrix;                            // 0x0004
    uint8_t some_uints0[4];                         // 0x0008
    uint8_t some_uints1[4];                         // 0x000C
    char pad_0010[4];                               // 0x0010
    class N00001713* p_c_light_mgr;                 // 0x0014
    char pad_0018[296];                             // 0x0018
}; // Size: 0x0140

class rModelBoneIndices {
public:
    uint8_t bn_ind[4]; // 0x0000
}; // Size: 0x0004
#pragma endregion

struct IndexData {
    std::int32_t ref_count{};
    std::uint32_t prim_count;
    std::uint32_t index_count;
    std::vector<uint16_t> ib;
};

IndexData make_index_buffer(SomeRenderingData* srd) {
    assert(srd->vert_count);
#ifndef NDEBUG
    // printf("make_index_buffer() vert_count:%d\n", srd->vert_count);
#endif // !NDEBUG

    IndexData result;
    result.prim_count = 0;

    std::uint16_t p1 = 0, p2 = 1;
    bool wnd = 1; // winding order
    std::vector<uint16_t> indices;
    indices.reserve(srd->vert_count * 3);

    for (uint32_t i = 2; i < srd->vert_count; ++i) {
        std::uint16_t p3 = i;

        if (p1 >= srd->vert_count || p2 >= srd->vert_count || p3 >= srd->vert_count) {
            printf("Bad index detected: %d, %d, %d\n", p1, p2, p3);
        }

        bool tri_skip{false};
        if (srd->scmdata_ptr) { // static meshes
            tri_skip = srd->scmdata_ptr[p3].triSkipFlag;
            if (srd->weightdata_ptr0) {
                tri_skip = ((srd->weightdata_ptr0[p3].bone_weights >> 0xF) & 1);
            }
        } else { // stored in bone weight for characters
            tri_skip = ((srd->weightdata_ptr0[p3].bone_weights >> 0xF) & 1);
        }
        if (!tri_skip) {
            // compute triangle normal and winding order
            Vector3 v1 = srd->verts_ptr0[p1];
            Vector3 v2 = srd->verts_ptr0[p2];
            Vector3 v3 = srd->verts_ptr0[p3];

            Vector3 face_edge1 = v3 - v1;
            Vector3 face_edge2 = v2 - v1;
            face_edge1         = glm::normalize(face_edge1);
            face_edge2         = glm::normalize(face_edge2);

            Vector3 z = glm::cross(face_edge1, face_edge2);
            z         = glm::normalize(z);

            Vector3 normal1 = srd->normals_ptr[p1];
            Vector3 normal2 = srd->normals_ptr[p2];
            Vector3 normal3 = srd->normals_ptr[p3];
            Vector3 normal  = glm::normalize(normal1 + normal2 + normal3);

            // Add indices in the correct winding order
            // wnd = glm::dot(normal, z) > 0.0f;
            // ratmix normals look inverted with code above for some reason
            wnd = glm::dot(normal, z) < 0.0f;
            if (wnd) {
                indices.push_back(p1);
                indices.push_back(p3);
                indices.push_back(p2);
            } else {
                indices.push_back(p1);
                indices.push_back(p2);
                indices.push_back(p3);
            }
            result.prim_count += 1;
        }

        // Update previous indices for next iteration
        p1 = p2;
        p2 = p3;
    }

    auto num_indices = std::distance(indices.begin(), indices.end());
    // srd->starting_index = num_indices;
    result.index_count = num_indices;
    result.ib          = std::move(indices);
    return result;
}

void cdraw_set_render_data_hook(SomeRenderingData* srd) {
    if (!srd) {
        return;
    }
    assert(srd->vert_count);
    // srd->starting_index = 0xDEADBEEF; // test

#if 0
    const size_t size = indices.size() * sizeof(WORD);
    void* mem = utility::arena_alloc(&g_index_buffer, size );
    memcpy(mem, indices.data(), size);
#endif
}

static uintptr_t cdraw_set_render_data_struct_jmp = 0x0068BE10;
// clang-format off
static __declspec(naked) void cdraw_set_render_data_struct() {
    __asm {
        pushad
        push edi
        call cdraw_set_render_data_hook
        add esp, 4
        popad
    originalCode:
        mov [esp+18h], eax
        cmp eax,edx
        jmp dword ptr[cdraw_set_render_data_struct_jmp]
    }
}
// clang-format on

struct RDrawSomethingStruct {
    DWORD verts_or_whatever;
    /*
        uint8_t col_r0;
        uint8_t col_g0;
        uint8_t col_b0;
        uint8_t col_a0;
    */
    uint8_t col_r1;
    uint8_t col_g1;
    uint8_t col_b1;
    uint8_t col_a1;
    Matrix4x4* p_some_matrix;
    struct SomeRenderingData* srd;
    uint32_t some_flags;
};

size_t g_vertices_offset{0};
size_t g_indices_offset{0};

enum EVertexBufferType {
    ARTICULATED_MODELS = 1, // unused i think
    GUI_QUADS          = 2,
    WORLD              = 3,
};

struct MatrixIndices {
    union {
        BYTE index[4];
        DWORD indices;
    };
};
static_assert(sizeof(MatrixIndices) == sizeof(DWORD));

struct VertexDefDynamic {
    Vector3 pos;
    Vector3 weight;
    MatrixIndices mat_indices;
    Vector3 normal;

    uint8_t diff_r; // 0x0018
    uint8_t diff_g; // 0x0019
    uint8_t diff_b; // 0x001A
    uint8_t diff_a; // 0x001B
    uint8_t spec_r; // 0x001C
    uint8_t spec_g; // 0x001D
    uint8_t spec_b; // 0x001E
    uint8_t spec_a; // 0x001F

    Vector2 uv0; // 0x0020
};

// static_assert(sizeof(VertexDefDynamic) == sizeof(VertexDef));
//  TODO(): find where to stick this
// static constexpr DWORD vertex_format_dmc3_3d = D3DFVF_XYZ | D3DFVF_NORMAL | D3DFVF_DIFFUSE | D3DFVF_SPECULAR | D3DFVF_TEX1 | D3DFVF_TEX2;
static constexpr DWORD vertex_format_dmc3_3d_ffp_skinning = D3DFVF_XYZB4 | D3DFVF_LASTBETA_UBYTE4 | D3DFVF_NORMAL | D3DFVF_DIFFUSE | D3DFVF_SPECULAR | D3DFVF_TEX1;

struct DIPData {
    std::uint32_t vertex_count_ours;
    std::uint32_t primitive_count_ours;
    std::uint32_t index_count_ours;
    std::uint32_t base_vertex_index;
    std::uint32_t start_index;
    Matrix4x4* matrices{};
    Matrix4x4* world{};
    std::uint16_t bone_count;
    std::uint16_t source_bone_count;
    std::vector<uint8_t> palette_to_global;
    // std::vector<std::uint16_t> index_buffer_ours;
    // std::vector<VertexDef> vertex_buffer_ours;

    // LPDIRECT3DVERTEXBUFFER9 p_vb = NULL;
    // LPDIRECT3DINDEXBUFFER9  p_ib = NULL;
};

